Revit 2027 API
UIApplication.MainWindowHandle Property
Get the handle of the Revit main window.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IntPtr MainWindowHandle { get; }
Public Overridable ReadOnly Property MainWindowHandle As IntPtr
	Get
public:
virtual property IntPtr MainWindowHandle {
	IntPtr get ();
}
abstract MainWindowHandle : IntPtr with get
override MainWindowHandle : IntPtr with get
Property Value
IntPtr
Remarks
Returns the main window handle of the Revit application. This handle should be used when displaying modal dialogs and message windows to insure that they are properly parented. This property replaces System.Diagnostics.Process.GetCurrentProcess().MainWindowHandle property, which is no longer a reliable method of retrieving the main window handle starting with Revit 2019.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace